package m02basics.tasks;

/**
 * Создайте игру «Камень, ножницы, бумага». Оба игрока должны ввести слово rock, paper или scissors
 * и в зависимости от введенного слова программа будет определять победителя
 * и выводить информацию об этом на экран.
 * Сделайте сравнение выбранных данных в виде функции,
 * которая будет возвращать результат.Требование: игроки будут вводить данные используя Scanner.
 * Вам необходимо сравнивать данные и определять кто выиграл.
 * Правила:
 *Камень бьет ножницы;
 *Ножницы бьют бумагу;
 *Бумага бьет камень.
 */

public class HandGame {
    public static void main(String[] args) {
        //сдал в ispring
    }
}
