package m06collection.s.task;

/**
 * Добавление элементов в двухсвязный список
 * Создайте класс StringsLinkedLis в котором обявите поля first и last ( оба поля должны быть объявлены с ключевым словом  private)
 * first last указывают соот-но на первый и последний элемент
 *  Необходимо реализовать метод add который должен создавать новый объект класса Node,в который он поместит переданное значение
 *   по списку можно проходить как с первого элементы до последнего , так и  наоборот ( не забывайте менять менять ссылки рядом стоящих элементов)
 *
 *   Node first( Node last) не должны иметь значение, только указывает на первый( последний ) элемент
 *
 */

public class StringsLinkedLis {
    //TODO
}
