package SystemCityTransport;


/**
 * Необходимо разработать систему автоматизирующую процесс аренды транспортных средств ( велосипеды, самокаты):
 * 1. В системе предполагается 2 вида пользователей: обычные пользователи (арендаторы) и администраторы.
 * Все пользователи осуществляют аутентификацию в системе посредством ввода логина и пароля. В качестве логина используется E-mail пользователя.
 * 2. Администратор обладает полным доступом (чтение/изменение/удаление) ко всем сущностям системы.
 * 3. Пользователь имеет личный баланс счета (руб.). Пользователь (арендатор) может:
 * Искать свободные транспортные средства;
 * Арендовать определенное свободное ТС;
 * Совершить поездку и закрыть аренду в зоне разрешенной парковки;
 * 4. В системе ведется всех ТС: идентификационный номер, тип ТС, состояние (отличное, хорошее, удовлетворительное), текущая зона парковки.
 * Для электросамокатов - % заряда электродвигателя, максимальная скорость.
 * 5. В системе ведется учет всех аренд ТС: ТС, время начала/конца аренды, начальная/конечная точка парковки, статус аренды (создана, завершена).
 * 6. В системе ведется учет всех зон парковки: идентификационный номер, координаты, разрешенный радиус парковки, тип (все ТС, только велосипеды, только самокаты).
 */
public class Project {

}
