package m09functionalprogramming;

/**
 * Разработать статический метод, который получает радиус шара и вычисляет объем шара.
 * Реализовать передачу метода вычисления объема шара в другой метод в качестве параметра.
 * Результат вывести в консоль
 *
 * Необходимые элементы :
 * - функциональный интерфейс с объявленным 1 методом ( получает и возвращает  число типа double)
 * - класс  в котором объяв-ся статический метод ( метод получает радиус шара и возвращает объем )
 * - класс в котором объявл-ся метод (этот метод получает два парметра : 1 - ссылк ана интерфейс, 2- радиус окружности)
 *
 */

public class LlinkForMethod {
    //TODO
}
